export type tGroup = {
  id: number;
  Группа: string | number;
  "Минимальный экспорт": number;
  "Максимальный экспорт": number;
  "Средний экспорт": number;
}[];

export const countries: tGroup = [
  {
    id: 1,
    Группа: "Вьетнам",
    "Минимальный экспорт": 440,
    "Максимальный экспорт": 462,
    "Средний экспорт": 451
  },
  {
    id: 2,
    Группа: "Германия",
    "Минимальный экспорт": 368,
    "Максимальный экспорт": 368,
    "Средний экспорт": 368
  },
  {
    id: 3,
    Группа: "Гонконг",
    "Минимальный экспорт": 367,
    "Максимальный экспорт": 484,
    "Средний экспорт": 425.5
  },
  {
    id: 4,
    Группа: "Испания",
    "Минимальный экспорт": 356,
    "Максимальный экспорт": 356,
    "Средний экспорт": 356
  },
  {
    id: 5,
    Группа: "Иран",
    "Минимальный экспорт": 435,
    "Максимальный экспорт": 435,
    "Средний экспорт": 435
  },
  {
    id: 6,
    Группа: "Казахстан",
    "Минимальный экспорт": 372,
    "Максимальный экспорт": 420,
    "Средний экспорт": 396
  },
  {
    id: 7,
    Группа: "Канада",
    "Минимальный экспорт": 355,
    "Максимальный экспорт": 553,
    "Средний экспорт": 454
  },
  {
    id: 8,
    Группа: "КНР",
    "Минимальный экспорт": 356,
    "Максимальный экспорт": 632,
    "Средний экспорт": 494
  },
  {
    id: 9,
    Группа: "Кувейт",
    "Минимальный экспорт": 371,
    "Максимальный экспорт": 372,
    "Средний экспорт": 371.5
  },
  {
    id: 10,
    Группа: "Латвия",
    "Минимальный экспорт": 369,
    "Максимальный экспорт": 374,
    "Средний экспорт": 371.5
  },
  {
    id: 11,
    Группа: "Малайзия",
    "Минимальный экспорт": 405,
    "Максимальный экспорт": 452,
    "Средний экспорт": 428.5
  },
  {
    id: 12,
    Группа: "ОАЭ",
    "Минимальный экспорт": 356,
    "Максимальный экспорт": 828,
    "Средний экспорт": 592
  },
  {
    id: 13,
    Группа: "Польша",
    "Минимальный экспорт": 646,
    "Максимальный экспорт": 646,
    "Средний экспорт": 646
  },
  {
    id: 14,
    Группа: "Россия",
    "Минимальный экспорт": 354,
    "Максимальный экспорт": 540,
    "Средний экспорт": 447
  },
  {
    id: 15,
    Группа: "Румыния",
    "Минимальный экспорт": 352,
    "Максимальный экспорт": 421,
    "Средний экспорт": 386.5
  },
  {
    id: 16,
    Группа: "Словения",
    "Минимальный экспорт": 360,
    "Максимальный экспорт": 381,
    "Средний экспорт": 370.5
  },
  {
    id: 17,
    Группа: "США",
    "Минимальный экспорт": 350,
    "Максимальный экспорт": 629,
    "Средний экспорт": 489.5
  },
  {
    id: 18,
    Группа: "Тайвань",
    "Минимальный экспорт": 378,
    "Максимальный экспорт": 509,
    "Средний экспорт": 443.5
  },
  {
    id: 19,
    Группа: "Узбекистан",
    "Минимальный экспорт": 350,
    "Максимальный экспорт": 375,
    "Средний экспорт": 362.5
  },
  {
    id: 20,
    Группа: "Украина",
    "Минимальный экспорт": 354,
    "Максимальный экспорт": 385,
    "Средний экспорт": 369.5
  },
  {
    id: 21,
    Группа: "Южная Корея",
    "Минимальный экспорт": 555,
    "Максимальный экспорт": 600,
    "Средний экспорт": 577.5
  },
  {
    id: 22,
    Группа: "Япония",
    "Минимальный экспорт": 634,
    "Максимальный экспорт": 634,
    "Средний экспорт": 634
  }
];

export const years: tGroup = [
  {
    id: 1,
    Группа: 1931,
    "Минимальный экспорт": 449,
    "Максимальный экспорт": 449,
    "Средний экспорт": 449
  },
  {
    id: 2,
    Группа: 1961,
    "Минимальный экспорт": 354,
    "Максимальный экспорт": 354,
    "Средний экспорт": 354
  },
  {
    id: 3,
    Группа: 1963,
    "Минимальный экспорт": 629,
    "Максимальный экспорт": 629,
    "Средний экспорт": 629
  },
  {
    id: 4,
    Группа: 1967,
    "Минимальный экспорт": 540,
    "Максимальный экспорт": 540,
    "Средний экспорт": 540
  },
  {
    id: 5,
    Группа: 1968,
    "Минимальный экспорт": 368,
    "Максимальный экспорт": 368,
    "Средний экспорт": 368
  },
  {
    id: 6,
    Группа: 1969,
    "Минимальный экспорт": 368,
    "Максимальный экспорт": 457,
    "Средний экспорт": 412.5
  },
  {
    id: 7,
    Группа: 1971,
    "Минимальный экспорт": 380,
    "Максимальный экспорт": 380,
    "Средний экспорт": 380
  },
  {
    id: 8,
    Группа: 1973,
    "Минимальный экспорт": 385,
    "Максимальный экспорт": 385,
    "Средний экспорт": 385
  },
  {
    id: 9,
    Группа: 1974,
    "Минимальный экспорт": 356,
    "Максимальный экспорт": 646,
    "Средний экспорт": 501
  },
  {
    id: 10,
    Группа: 1976,
    "Минимальный экспорт": 355,
    "Максимальный экспорт": 553,
    "Средний экспорт": 454
  },
  {
    id: 11,
    Группа: 1977,
    "Минимальный экспорт": 371,
    "Максимальный экспорт": 371,
    "Средний экспорт": 371
  },
  {
    id: 12,
    Группа: 1980,
    "Минимальный экспорт": 350,
    "Максимальный экспорт": 350,
    "Средний экспорт": 350
  },
  {
    id: 13,
    Группа: 1983,
    "Минимальный экспорт": 372,
    "Максимальный экспорт": 372,
    "Средний экспорт": 372
  },
  {
    id: 14,
    Группа: 1985,
    "Минимальный экспорт": 370,
    "Максимальный экспорт": 375,
    "Средний экспорт": 372.5
  },
  {
    id: 15,
    Группа: 1987,
    "Минимальный экспорт": 369,
    "Максимальный экспорт": 420,
    "Средний экспорт": 394.5
  },
  {
    id: 16,
    Группа: 1990,
    "Минимальный экспорт": 367,
    "Максимальный экспорт": 367,
    "Средний экспорт": 367
  },
  {
    id: 17,
    Группа: 1991,
    "Минимальный экспорт": 415,
    "Максимальный экспорт": 415,
    "Средний экспорт": 415
  },
  {
    id: 18,
    Группа: 1992,
    "Минимальный экспорт": 374,
    "Максимальный экспорт": 405,
    "Средний экспорт": 389.5
  },
  {
    id: 19,
    Группа: 1994,
    "Минимальный экспорт": 468,
    "Максимальный экспорт": 468,
    "Средний экспорт": 468
  },
  {
    id: 20,
    Группа: 1995,
    "Минимальный экспорт": 352,
    "Максимальный экспорт": 421,
    "Средний экспорт": 386.5
  },
  {
    id: 21,
    Группа: 1996,
    "Минимальный экспорт": 350,
    "Максимальный экспорт": 384,
    "Средний экспорт": 367
  },
  {
    id: 22,
    Группа: 1997,
    "Минимальный экспорт": 378,
    "Максимальный экспорт": 391,
    "Средний экспорт": 384.5
  },
  {
    id: 23,
    Группа: 1998,
    "Минимальный экспорт": 452,
    "Максимальный экспорт": 452,
    "Средний экспорт": 452
  },
  {
    id: 24,
    Группа: 1999,
    "Минимальный экспорт": 421,
    "Максимальный экспорт": 421,
    "Средний экспорт": 421
  },
  {
    id: 25,
    Группа: 2000,
    "Минимальный экспорт": 355,
    "Максимальный экспорт": 356,
    "Средний экспорт": 355.5
  },
  {
    id: 26,
    Группа: 2003,
    "Минимальный экспорт": 416,
    "Максимальный экспорт": 435,
    "Средний экспорт": 425.5
  },
  {
    id: 27,
    Группа: 2004,
    "Минимальный экспорт": 509,
    "Максимальный экспорт": 509,
    "Средний экспорт": 509
  },
  {
    id: 28,
    Группа: 2008,
    "Минимальный экспорт": 363,
    "Максимальный экспорт": 492,
    "Средний экспорт": 427.5
  },
  {
    id: 29,
    Группа: 2009,
    "Минимальный экспорт": 423,
    "Максимальный экспорт": 600,
    "Средний экспорт": 511.5
  },
  {
    id: 30,
    Группа: 2010,
    "Минимальный экспорт": 376,
    "Максимальный экспорт": 828,
    "Средний экспорт": 602
  },
  {
    id: 31,
    Группа: 2011,
    "Минимальный экспорт": 440,
    "Максимальный экспорт": 440,
    "Средний экспорт": 440
  },
  {
    id: 32,
    Группа: 2012,
    "Минимальный экспорт": 634,
    "Максимальный экспорт": 634,
    "Средний экспорт": 634
  },
  {
    id: 33,
    Группа: 2013,
    "Минимальный экспорт": 632,
    "Максимальный экспорт": 632,
    "Средний экспорт": 632
  },
  {
    id: 34,
    Группа: 2014,
    "Минимальный экспорт": 381,
    "Максимальный экспорт": 381,
    "Средний экспорт": 381
  },
  {
    id: 35,
    Группа: 2015,
    "Минимальный экспорт": 354,
    "Максимальный экспорт": 426,
    "Средний экспорт": 390
  },
  {
    id: 36,
    Группа: 2016,
    "Минимальный экспорт": 374,
    "Максимальный экспорт": 374,
    "Средний экспорт": 374
  },
  {
    id: 37,
    Группа: 2017,
    "Минимальный экспорт": 555,
    "Максимальный экспорт": 600,
    "Средний экспорт": 577.5
  },
  {
    id: 38,
    Группа: 2018,
    "Минимальный экспорт": 461,
    "Максимальный экспорт": 462,
    "Средний экспорт": 461.5
  }
];

export const regions: tGroup = [
  {
    id: 1,
    Группа: "Азия",
    "Минимальный экспорт": 350,
    "Максимальный экспорт": 828,
    "Средний экспорт": 489.5
  },
  {
    id: 2,
    Группа: "Европа",
    "Минимальный экспорт": 352,
    "Максимальный экспорт": 646,
    "Средний экспорт": 432.5
  },
  {
    id: 3,
    Группа: "Северная Америка",
    "Минимальный экспорт": 350,
    "Максимальный экспорт": 629,
    "Средний экспорт": 471.75
  },
  {
    id: 4,
    Группа: "Ближний Восток",
    "Минимальный экспорт": 355,
    "Максимальный экспорт": 828,
    "Средний экспорт": 526.5
  }
];
